In [2]:
import pandas as pd
import sqlalchemy
import pyodbc
import numpy as np
from numpy import random

engine = sqlalchemy.create_engine("mssql+pyodbc://YOUR_USER:YOUR_PASSWORD@NORTHWIND")

In [3]:
orders = pd.read_sql_table("Orders", engine)
order_details = pd.read_sql_table("Order Details", engine)
customers = pd.read_sql_table("Customers", engine)
products = pd.read_sql_table("Products", engine)
employees = pd.read_sql_table("Employees", engine)

# Playing SQL with DataFrames

*We can use boolean algebra to filter data*
- But don't forget to enclose them in braces and separate from each other
- Also don't use pythons *and*, *or* and *not* but **&**,**|** and **!**

In [4]:
orders[(orders['Freight'] >= 55.28) & (orders['Freight'] <= 208.58)]
orders.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium

**Grouping**

In [10]:
grouped_orders = orders.groupby('EmployeeID')

**Iterating over DataFrames**

In [54]:
grouped_employee_names = []
for i in grouped_orders.groups.iterkeys():
    employee = employees[employees['EmployeeID'] == i]
    grouped_employee_names.append(employee.FirstName.values[0])

In [55]:
grouped_employee_names

[u'Nancy',
 u'Andrew',
 u'Janet',
 u'Margaret',
 u'Steven',
 u'Michael',
 u'Robert',
 u'Laura',
 u'Anne']

**Lambdas**

*We can combine iterators with lambdas for more consise code*

In [60]:
for i in grouped_orders.groups.itervalues():
    mapped_order_details = map(lambda line_id: order_details.iloc[line_id,:], i)

In [61]:
mapped_order_details[0]

OrderID      10250.00
ProductID       65.00
UnitPrice       16.80
Quantity        15.00
Discount         0.15
Name: 7, dtype: float64

**Aggregating functions**

In [63]:
grouped_aggregated_orders = grouped_orders.agg(sum)
grouped_aggregated_orders

            OrderID  ShipVia   Freight
EmployeeID
1           1312412      249   8836.64
2           1027871      182   8696.41
3           1354153      264  10884.74
4           1659669      306  11346.14
5            446237       83   3918.71
6            713137      130   3780.47
7            768410      152   6665.44
8           1106793      210   7487.88
9            461193       90   3326.26

*Multiple aggregating function are also possible*

Just pass a **dictionary** that maps columns to functions

In [68]:
grouped_order_details = order_details.groupby('OrderID').agg({'UnitPrice':'mean','Quantity':'sum'})
grouped_order_details.head()

         UnitPrice  Quantity
OrderID
10248    19.533333        27
10249    30.500000        49
10250    22.300000        60
10251    16.400000        41
10252    31.333333       105

**Reindexing**

*We can define or re-define indices, and set defaults for missing values*

In [64]:
grouped_aggregated_orders.reindex(index=[1,2,3,4,5,6,7,8,9,10,11,12], fill_value=0)

            OrderID  ShipVia   Freight
EmployeeID
1           1312412      249   8836.64
2           1027871      182   8696.41
3           1354153      264  10884.74
4           1659669      306  11346.14
5            446237       83   3918.71
6            713137      130   3780.47
7            768410      152   6665.44
8           1106793      210   7487.88
9            461193       90   3326.26
10                0        0      0.00
11                0        0      0.00
12                0        0      0.00

**Merging with JOIN**

*Alternatively we can use Panda's **join** method to merge two DataFrames without providing a key*


If DataFrames contain overlapping keys suffixes must be provided. In this example both DataFrames contain the column **OrderID** and therefore we expand their names to *_left* respectively *_right*

In [12]:
joined_orders = orders.join(order_details,lsuffix='_left', rsuffix='_right')
joined_orders.head()

,OrderID_left,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry,OrderID_right,ProductID,UnitPrice,Quantity,Discount
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France,10248,11,14.0,12,0
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany,10248,42,9.8,10,0
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil,10248,72,34.8,5,0
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France,10249,14,18.6,9,0
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium,10249,51,42.4,40,0

# Panels

*Beside Series and DataFrames pandas can create 3D structures with Panels*
With Panels we create a complex structure holding entire DataFrames as "array members" 
It's important to know that member DataFrames **don't have to be of the same length** like shown in the example below.


There we define the **first DataFrame** as containing all rows and columns but the other two have only a *partial view* of the
complete structure (their indices are shorter and some of the available columns are not available to them)

In [172]:
major_axis = [0,1,2,3,4]                                 # major axis defining the ROWS of the 3D structure 
minor_axis = ['rand0','rand1','rand2','rand3','rand4']   # minor axis defining COLUMNS of the 3D structure

# these DataFrames will be the "items" of the Panel

# this DF owns a complete view of the whole Panel structure (all rows, all columns)
first_DF  = pd.DataFrame(random.randn(5,5),columns=minor_axis,index=major_axis) 

# this DF "sees" only certain parts of the Panel
second_DF = pd.DataFrame(random.randn(3,3),columns=['rand0','rand2','rand3'],index=[0,1,3])

# this DF also sees only a part of the Panel but not the same like the DF before it
third_DF  = pd.DataFrame(random.randn(2,2),columns=['rand2','rand4'],index=[2,4])

# feed the panel with these DataFrames
panel = pd.Panel({'DataFrame_0': first_DF, 'DataFrame_1': second_DF, 'DataFrame_2': third_DF})

In [173]:
# iterate over the items (that is, DataFrames) and print out the first three columns of every row 
for item in panel.items:
  print(panel[item].iloc[:,0:3])

      rand0     rand1     rand2
0 -0.036808  0.146876 -0.121842
1  0.341124 -1.508298  2.015916
2 -0.883147  0.200315  2.176069
3  2.081299 -0.219334  0.355026
4 -0.017699 -0.473054  0.181512
      rand0  rand1     rand2
0  2.147876    NaN -0.849704
1 -0.865687    NaN  0.423879
2       NaN    NaN       NaN
3 -1.496546    NaN -1.313617
4       NaN    NaN       NaN
   rand0  rand1     rand2
0    NaN    NaN       NaN
1    NaN    NaN       NaN
2    NaN    NaN -0.110575
3    NaN    NaN       NaN
4    NaN    NaN -0.877938